DB_URL = "postgresql+asyncpg://telegram:Dark601529!@109.172.88.252:5432/telegram_bots"
TG_API_KEY_1 = "6801055838:AAH7wiVaTgyFZN-OuUxxXUf2O1RyyNyTuRc"
TG_API_KEY_2 = "6334762233:AAHAKmbAfLk2mfdSTzVMEvtV--fzlqIWXxg"

FGIS_API_ENDPOINT = "https://fgis.gost.ru/fundmetrology/eapi/vri"

QUASAR_GREETING = "Данный бот-помощник выдает данные по поверке, которые проходят ТОЛЬКО через метрологическую службу Квазар.\n\nДля работы бота вы подтверждаете Ваш номер телефона.\n\nДалее бот попросит Вас ввести серийный номер прибора: Заводской номер / Буквенно-цифровое обозначение. По ходу процесса, бот будет вам помогать."
ARSHIN_GREETING = "Данный бот-помощник выдает данные по поверке, которые проходят через систему “АРШИН”.\n\nДля работы бота вы подтверждаете Ваш номер телефона.\n\nВам потребуется ИНН вашей организации.\n\nБот попросит Вас ввести регистрационный номер типа СИ и серийный номер прибора. \n\nПо ходу процесса, бот будет вам помогать."

GET_PHONE_ERROR_MESSAGE = "Воспользуйтесь кнопкой на клавиатуре!"
GET_INN_ERROR_MESSAGE = "Убедитесь в правильности набора ИНН"

NO_RESULTS_MESSAGE = "По вашему запросу ничего не найдено!"

GET_MI_MESSAGE = "Укажите Заводской номер / Буквенно-цифровое обозначение:"
GET_MI_ERROR_MESSAGE = "Убедитесь в правильности указанного серийного номера. Номер указывается без надписи “S/N, заводской номер и т.п.”\nПример: S/N: H-0870 в запросе указывается H-0870"
GET_MIT_MESSAGE = "Укажите Регистрационный номер типа СИ"
GET_MIT_ERROR_MESSAGE = "Убедитесь в правильности регистрационного номер типа СИ"
GET_INN_MESSAGE = "Укажите ИНН вашей организации."
